# Taller

En este taller trabajará con dos dataset  'title.csv' y 'cast.csv'. El archivo 'title.csv' contiene la lista de películas con el año de estreno; mientras que el archivo 'cast.csv' tiene cinco columnas que almacenan el título de la película, año de estreno, elenco de estrellas, tipo (actor / actriz), personajes y calificaciones de los actores, como se muestra a continuación,

In [2]:
#En esta celda se van a dejar  las librerías que usará a lo largo del taller
import pandas as pd

In [25]:
title= pd.read_csv('titles.csv')
cast= pd.read_csv('cast.csv')

In [17]:
#Despliegue una muestra del dataset title (head, tail, sample)
title.head()

                                   title  year
0                                 Mahler  1974
1           Ogon, voda i... mednye truby  1968
2  Ana Nojoom bent alasherah wamotalagah  2014
3                      Malu de Bicicleta  2010
4             Nazareno Apostol: Boy Ahas  1989

In [26]:
title.tail()

                       title  year
230402         El lobo negro  1981
230403  Komu na Rusi zhit...  1989
230404              Senotaji  2013
230405     The Leopard Woman  1920
230406    Mio caro assassino  1972

In [19]:
title.sample()

      title  year
89718  Kizu  1988

In [27]:
#Despliegue una muestra del dataset cast  (head, tail, sample)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [28]:
cast.tail()

                                    title  year  ...               character     n
3564645                    Stuttur Frakki  1993  ...              Flugfreyja  24.0
3564646                           Foxtrot  1988  ...                    D?ra  24.0
3564647  Niceland (Population. 1.000.002)  2004  ...            Woman in Bus  26.0
3564648                      U.S.S.S.S...  2003  ...  Afgr.dama ? bens?nst??  17.0
3564649                 Bye Bye Blue Bird  1999  ...       Pensionatv?rtinde   NaN

[5 rows x 6 columns]

In [29]:
cast.sample(3)

                title  year              name     type character     n
3493625  Sette a Tebe  1964  Lena von Martens  actress    Doride   2.0
1541519   Super Shark  2011       Jeff Murray    actor      Jake  21.0
477335       Mr. What  2015    David Cubberly    actor  Attorney   NaN

In [31]:
#Cuantos nomrbes de peliculas hay en title y cuantos son distintos
title.count()

title    230407
year     230407
dtype: int64

In [32]:
len(title.title.unique())

210691

In [33]:
#len(set(title.title))
len(title.groupby('title').count())

210691

In [34]:
#Cuantas peliculas por año en el dataset titles y cuantas en el dataset cast
title.groupby(["year"])["title"].count()

year
1894      1
1898      1
1899      1
1900      4
1903      1
       ...
2020    104
2021     15
2022     12
2023     10
2024      1
Name: title, Length: 125, dtype: int64

In [35]:
cast.groupby(["year"])["title"].count()

year
1894      3
1900      2
1905      1
1906     17
1907      5
       ...
2019    262
2020    123
2021     22
2022     17
2023      1
Name: title, Length: 121, dtype: int64

In [36]:
# cuantas peliculas tienen por nombre "Hamlet"
Num_Hamlet= title[title['title'] == 'Hamlet']

In [37]:
Num_Hamlet.count()

title    19
year     19
dtype: int64

In [38]:
#Cuantas peliculas son de nombre "Carmen" y son de antes de 1950
Pelicula_Carmen = title[(title['title'] == 'Carmen') & (title['year'] <= 1950)]

In [39]:
Pelicula_Carmen.count()

title    8
year     8
dtype: int64

In [40]:
# Titulos mas comunes en la historia filmografica
title['title'].value_counts()

Hamlet                  19
Carmen                  16
Macbeth                 15
The Three Musketeers    11
Othello                 11
                        ..
Driving Force            1
Immanuel                 1
Belial                   1
Yavrum                   1
Kattumakkan              1
Name: title, Length: 210691, dtype: int64

In [41]:
# Cual fue la primer pelicula hecha titulada "Romeo and Juliet"
primer_pelicula_RoJu = title[title['title'] == 'Romeo and Juliet']

In [42]:
primer_pelicula_RoJu

                   title  year
16975   Romeo and Juliet  2014
82622   Romeo and Juliet  1936
87037   Romeo and Juliet  1954
124702  Romeo and Juliet  1916
144796  Romeo and Juliet  2013
147308  Romeo and Juliet  1947
185337  Romeo and Juliet  1968
196039  Romeo and Juliet  1966

In [43]:
primer_pelicula_RoJu.iloc[3:4]

                   title  year
124702  Romeo and Juliet  1916

In [ ]:
# Lista todas las peliculas que contengan la palabra "Exorcist" 
# ordenadas de la mas antigua a la mas reciente

In [44]:

title[title['title'].str.contains("Exorcist")].sort_values(['year'], ascending=[True,]),

(                                         title  year
 88003                             The Exorcist  1973
 49658                  O Exorcista de Mulheres  1974
 140519                Exorcist II: The Heretic  1977
 220073                        Kung Fu Exorcist  1978
 17375                         The Exorcist III  1990
 132451                        Teenage Exorcist  1991
 117797                 Exorcist: The Beginning  2004
 94189        Dominion: Prequel to the Exorcist  2005
 209250  Costa Chica: Confession of an Exorcist  2006
 86354                      Exorcist Chronicles  2007
 130686                      The Disco Exorcist  2011
 57932                      Exorcist Chronicles  2013
 69974                           Shark Exorcist  2015
 51101                            Bad Exorcists  2015
 151850                              Exorcistas  2015
 60700                      Accidental Exorcist  2016
 161093                       American Exorcist  2016
 195615                    Diary of an Exorcist  2016
 228642                  Exorcist House of Evil  2016,)

In [45]:
# Cuantas peliculas fueron hechas en el año 1950?

title.query("year == 1950").count()

title    1081
year     1081
dtype: int64

In [46]:
# Cuantas peliculas fueron despues del año 1970?
title.query("year > 1970").count()
#peliculas_D1970 = title[(title['year'] > 1970)]

title    164559
year     164559
dtype: int64

In [47]:
# Cuantas peliculas fueron hechas de 1970 a 1979

In [ ]:
title.loc[(title['year'] >= 1970) & (title['year'] <= 1979)].count()

title    18508
year     18508
dtype: int64

Ahora se trabajara con el dataset de cast, importante tambien tener en cuneta que e sun dataset que se tendra que limpiar con el paso de las clases y dejarlo lo mas optimo posible

In [48]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [49]:
The_Godfather = cast[(cast["title"]== "The Godfather")]

In [50]:
len(The_Godfather.character.unique())

75

In [51]:
# Cuantos roles o papeles hubo en la pelicula "The Godfather"

cast.loc[cast.title == "The Godfather"]

                 title  year  ...                        character     n
51214    The Godfather  1972  ...                        Policeman   NaN
102809   The Godfather  1972  ...            Luca Brasi's Assassin   NaN
220852   The Godfather  1972  ...                            Cuneo  15.0
248000   The Godfather  1972  ...                Don Vito Corleone   1.0
248738   The Godfather  1972  ...  Extra in Furniture-Moving Scene   NaN
...                ...   ...  ...                              ...   ...
3137607  The Godfather  1972  ...                      Night Nurse   NaN
3360381  The Godfather  1972  ...                    Mrs. Clemenza  29.0
3363276  The Godfather  1972  ...                           Connie  12.0
3390198  The Godfather  1972  ...           Extra in Wedding Scene   NaN
3399922  The Godfather  1972  ...    Apollonia - Sicilian Sequence  30.0

[76 rows x 6 columns]

In [52]:
# Cuantos papeles en la pelicula "The Godfather" si estuvieron clasificados con un valor "n"

(The_Godfather.groupby(["character"])["n"].value_counts()).count()

34

In [53]:
# Mostrar el elenco completo de la pelicula "2001: A Space Odyssey" 
# ordenado por su clasificasión "n", ignorando los papeles que no se les asigno ningun valor "n"
Space_O = cast[(cast["title"] =="2001: A Space Odyssey")]
#cast.loc[(cast["title"]== "2001: A Space Odyssey")].loc[cast["name"]]

In [54]:
Space = Space_O[['name', "n"]]

In [55]:
Space.sort_values(by='n', ascending =False)

                       name     n
2359428  Richard (II) Woods  39.0
2343583         Bob Wilyman  38.0
2273687        Andy Wallace  37.0
1801551          Joe Refalo  36.0
1644362         Darryl Paes  35.0
1361809   Laurence Marchant  34.0
1329956        Scott MacKee  33.0
1074233     John (X) Jordan  32.0
1030910        Tony Jackson  31.0
954413          David Hines  30.0
916925         Brian Hawley  29.0
849029         Danny Grover  28.0
702077      David Fleetwood  27.0
601760         Terry Duggan  26.0
541763         P?ter Delm?r  25.0
515635         Jonathan Daw  24.0
514378          Simon Davis  23.0
373027       David Charkham  22.0
161571           Jimmy Bell  21.0
85047     John (III) Ashley  20.0
1302983         Mike Lovell  19.0
2690543     Heather Downham  18.0
2529579        Penny Brahms  17.0
2572025      Edwina Carroll  16.0
2787922          Ann Gillis  15.0
788106         Alan Gifford  14.0
153470           Glenn Beck  13.0
197975            Ed Bishop  12.0
2310523         Bill Weston  11.0
1469910        Frank Miller  10.0
1775057        Douglas Rain   9.0
2101643       Sean Sullivan   8.0
151781        Robert Beatty   7.0
3464754     Margaret Tyzack   6.0
1872093    Leonard Rossiter   5.0
1823947      Daniel Richter   4.0
2113186   William Sylvester   3.0
1288927       Gary Lockwood   2.0
602795          Keir Dullea   1.0
49363           Martin Amor   NaN
55115    S. Newton Anderson   NaN
413298        John Clifford   NaN
462887         Harold Coyne   NaN
1121087     Kenneth Kendall   NaN
1219287        Roy Lansford   NaN
1263965    Jordan (VI) Levy   NaN
1741274         Ivor Powell   NaN
1951234         Kevin Scott   NaN
2111934      John Swindells   NaN
2194992      Burnell Tucker   NaN
2970794      Vivian Kubrick   NaN
3028729       Maggie London   NaN
3068615          Irena Marr   NaN
3068626       Krystyna Marr   NaN
3080475     Chela Matthison   NaN

In [56]:
# Mostrar el elenco completo ordenado por la clasificacion "n"
# de la pelicula "Dracula" de 1958

dracula_1958 =cast.loc[(cast["title"]== "Dracula")].loc[cast["year"]== 1958]

In [57]:
dracula_1958.sort_values(by='n', ascending =False)

           title  year  ...                 character     n
423307   Dracula  1958  ...                       Lad  17.0
148496   Dracula  1958  ...                    Porter  16.0
1347640  Dracula  1958  ...                Undertaker  15.0
171732   Dracula  1958  ...                  Official  14.0
2357769  Dracula  1958  ...                  Landlord  13.0
1453367  Dracula  1958  ...                 Policeman  12.0
1285506  Dracula  1958  ...             Doctor Seward  11.0
2444220  Dracula  1958  ...                      Inga  10.0
2731182  Dracula  1958  ...                     Tania   9.0
2777216  Dracula  1958  ...             Vampire Woman   8.0
2220986  Dracula  1958  ...                  Jonathan   7.0
2677557  Dracula  1958  ...                     Gerda   6.0
3069196  Dracula  1958  ...                      Lucy   5.0
3410427  Dracula  1958  ...                      Mina   4.0
822398   Dracula  1958  ...                    Arthur   3.0
1242308  Dracula  1958  ...             Count Dracula   2.0
1242307  Dracula  1958  ...                   Dracula   2.0
485197   Dracula  1958  ...        Doctor Van Helsing   1.0
1475047  Dracula  1958  ...              Coach Driver   NaN
1513434  Dracula  1958  ...  Coach Driver's Companion   NaN
1524497  Dracula  1958  ...             Hearse Driver   NaN

[21 rows x 6 columns]

In [58]:
# Cuantos papeles de "Bruce Wayne" han sido hechos en la historia  de las peliculas (papeles hace referencia a la coulumna character)
cast.loc[(cast["character"]== 'Bruce Wayne')].count()

title        38
year         38
name         38
type         38
character    38
n            26
dtype: int64